In [1]:
%load_ext sql

In [2]:
%%sql

sqlite:///CourseData.db

'Connected: @CourseData.db'

Show columns quick and efficiently

In [5]:
%%sql

PRAGMA table_info(DATASET3);

 * sqlite:///CourseData.db
Done.

[]

In [6]:
%%sql 

CREATE TABLE INSTRUCTOR(
    IID INTEGER PRIMARY KEY,
    Name TEXT NOT NULL
);

 * sqlite:///CourseData.db
Done.

[]

In [7]:
%%sql

CREATE TABLE LOCATION(
    LID INTEGER PRIMARY KEY,
    Location TEXT NOT NULL
);

 * sqlite:///CourseData.db
Done.

[]

In [8]:
%%sql

CREATE TABLE PROGRAM(
    PID INTEGER PRIMARY KEY,
    ProgramName TEXT NOT NULL
);

 * sqlite:///CourseData.db
Done.

[]

In [9]:
%%sql 

CREATE TABLE COURSE_CATALOG(
    CatalogID INTEGER NOT NULL, 
    PID INTEGER NOT NULL,
    Credits VARCHAR NOT NULL,
    Title TEXT NOT NULL,
    PreReqs TEXT,
    Attributes TEXT,
    Description TEXT,
    FOREIGN KEY (PID) REFERENCES PROGRAM(PID)
);

 * sqlite:///CourseData.db
Done.

[]

In [10]:
%%sql 

CREATE TABLE COURSE_OFFERINGS(
    COID INTEGER PRIMARY KEY,
    CRN INTEGER NOT NULL,
    Term TEXT NOT NULL,
    CatalogID TEXT NOT NULL,
    Section TEXT NOT NULL,
    Credits VARCHAR NOT NULL,
    Title TEXT NOT NULL, 
    Meetings TEXT NOT NULL,
    IID INTEGER NOT NULL,
    Cap INTEGER NOT NULL,
    Act INTEGER NOT NULL,
    Rem INTEGER NOT NULL,
    FOREIGN KEY (IID) REFERENCES INSTRUCTOR (IID),
    FOREIGN KEY (CatalogID) REFERENCES COURSE_CATALOG(CatalogID)
);

 * sqlite:///CourseData.db
Done.

[]

In [11]:
%%sql

CREATE TABLE COURSE_MEETINGS(
    CMID INTEGER PRIMARY KEY,
    LID INTEGER NOT NULL,
    Term TEXT NOT NULL,
    CRN INTEGER NOT NULL,
    Day TEXT NOT NULL,
    Start TEXT NOT NULL,
    End TEXT NOT NULL,
    FOREIGN KEY (LID) REFERENCES LOCATION(LID)
);

 * sqlite:///CourseData.db
Done.

[]

Populating the database with data

Here we populated the data with that we have imported into the 3 dataset tables

-Dataset 1
-Dataset 2
-Dataset 3

In [12]:
%%sql

INSERT INTO PROGRAM (ProgramName)
    SELECT DISTINCT program_name
    FROM DATASET1;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such table: DATASET1
[SQL: INSERT INTO PROGRAM (ProgramName)
    SELECT DISTINCT program_name
    FROM DATASET1;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [13]:
%%sql

INSERT INTO INSTRUCTOR (Name)
    SELECT DISTINCT primary_instructor
    FROM DATASET3;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such table: DATASET3
[SQL: INSERT INTO INSTRUCTOR (Name)
    SELECT DISTINCT primary_instructor
    FROM DATASET3;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [14]:
%%sql

INSERT INTO LOCATION (Location)
    SELECT DISTINCT location
    FROM DATASET2;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such table: DATASET2
[SQL: INSERT INTO LOCATION (Location)
    SELECT DISTINCT location
    FROM DATASET2;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [15]:
%%sql

INSERT INTO INSTRUCTOR (Name)
    SELECT DISTINCT primary_instructor
    FROM DATASET3;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such table: DATASET3
[SQL: INSERT INTO INSTRUCTOR (Name)
    SELECT DISTINCT primary_instructor
    FROM DATASET3;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [16]:
%%sql

INSERT INTO COURSE_CATALOG (PID, CatalogID, Title, PreReqs, Attributes, Description, Credits)
    SELECT PID, catalog_id, course_title, prereqs, attributes, description, credits
    FROM DATASET1 c
    INNER JOIN PROGRAM d ON d.ProgramName=c.program_name;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such table: DATASET1
[SQL: INSERT INTO COURSE_CATALOG (PID, CatalogID, Title, PreReqs, Attributes, Description, Credits)
    SELECT PID, catalog_id, course_title, prereqs, attributes, description, credits
    FROM DATASET1 c
    INNER JOIN PROGRAM d ON d.ProgramName=c.program_name;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [17]:
%%sql

INSERT INTO COURSE_OFFERINGS(CRN, Term, CatalogID, Section, Credits, Title, Meetings, IID, Cap, Act, Rem)
    SELECT crn, term, catalog_id, section, credits, title, meetings, IID, cap, act, rem
    FROM DATASET3 c
    INNER JOIN INSTRUCTOR i ON c.primary_instructor=i.name;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such table: DATASET3
[SQL: INSERT INTO COURSE_OFFERINGS(CRN, Term, CatalogID, Section, Credits, Title, Meetings, IID, Cap, Act, Rem)
    SELECT crn, term, catalog_id, section, credits, title, meetings, IID, cap, act, rem
    FROM DATASET3 c
    INNER JOIN INSTRUCTOR i ON c.primary_instructor=i.name;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [18]:
%%sql

INSERT INTO COURSE_MEETINGS (LID, Term, CRN, Day, Start, End)
    SELECT LID, term, crn, day, start, end
    FROM DATASET2 c
    INNER JOIN LOCATION l ON c.location=l.Location;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such table: DATASET2
[SQL: INSERT INTO COURSE_MEETINGS (LID, Term, CRN, Day, Start, End)
    SELECT LID, term, crn, day, start, end
    FROM DATASET2 c
    INNER JOIN LOCATION l ON c.location=l.Location;]
(Background on this error at: http://sqlalche.me/e/e3q8)